; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-13)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p1-12 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p3-6 - location
	p3-7 - location
	p3-9 - location
	p4-8 - location
	p5-11 - location
	p6-0 - location
	p6-5 - location
	p6-10 - location
	p7-8 - location
	p7-10 - location
	p8-10 - location
	p8-11 - location
	p9-1 - location
	p9-6 - location
	p9-8 - location
	p9-11 - location
	p11-1 - location
	p11-2 - location
	p12-3 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s3)
	(at driver3 s5)
	(at driver4 s6)
	(at driver5 s0)
	(at truck1 s5)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s10)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s10)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s11)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s6)
	(at package2 s10)
	(at package3 s6)
	(at package4 s0)
	(at package5 s8)
	(at package6 s11)
	(at package7 s2)
	(at package8 s11)
	(at package9 s1)
	(at package10 s7)
	(at package11 s7)
	(at package12 s6)
	(at package13 s1)
	(path s1 p1-12)
	(path p1-12 s1)
	(path s12 p1-12)
	(path p1-12 s12)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-10)
	(path p6-10 s6)
	(path s10 p6-10)
	(path p6-10 s10)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s8 p8-10)
	(path p8-10 s8)
	(path s10 p8-10)
	(path p8-10 s10)
	(path s8 p8-11)
	(path p8-11 s8)
	(path s11 p8-11)
	(path p8-11 s11)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s9 p9-11)
	(path p9-11 s9)
	(path s11 p9-11)
	(path p9-11 s11)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-2)
	(path p11-2 s11)
	(path s2 p11-2)
	(path p11-2 s2)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 12)
	(= (time-to-drive s1 s0) 12)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 29)
	(= (time-to-drive s3 s0) 29)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 77)
	(= (time-to-drive s6 s0) 77)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 41)
	(= (time-to-drive s7 s0) 41)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 32)
	(= (time-to-drive s0 s2) 32)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 27)
	(= (time-to-drive s4 s2) 27)
	(link s2 s12)
	(link s12 s2)
	(= (time-to-drive s2 s12) 45)
	(= (time-to-drive s12 s2) 45)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 96)
	(= (time-to-drive s1 s3) 96)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 18)
	(= (time-to-drive s2 s3) 18)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 31)
	(= (time-to-drive s7 s3) 31)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 10)
	(= (time-to-drive s8 s3) 10)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 29)
	(= (time-to-drive s5 s4) 29)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 77)
	(= (time-to-drive s7 s4) 77)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 38)
	(= (time-to-drive s0 s5) 38)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 9)
	(= (time-to-drive s6 s5) 9)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 89)
	(= (time-to-drive s8 s5) 89)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 83)
	(= (time-to-drive s1 s6) 83)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 57)
	(= (time-to-drive s2 s6) 57)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 12)
	(= (time-to-drive s4 s6) 12)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 61)
	(= (time-to-drive s8 s7) 61)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 41)
	(= (time-to-drive s10 s7) 41)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 38)
	(= (time-to-drive s0 s8) 38)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 11)
	(= (time-to-drive s0 s9) 11)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 48)
	(= (time-to-drive s1 s9) 48)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 64)
	(= (time-to-drive s6 s9) 64)
	(link s9 s10)
	(link s10 s9)
	(= (time-to-drive s9 s10) 13)
	(= (time-to-drive s10 s9) 13)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 98)
	(= (time-to-drive s11 s9) 98)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 27)
	(= (time-to-drive s0 s10) 27)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 44)
	(= (time-to-drive s3 s10) 44)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 81)
	(= (time-to-drive s8 s10) 81)
	(link s11 s2)
	(link s2 s11)
	(= (time-to-drive s11 s2) 46)
	(= (time-to-drive s2 s11) 46)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 56)
	(= (time-to-drive s3 s11) 56)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 10)
	(= (time-to-drive s4 s11) 10)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 22)
	(= (time-to-drive s8 s11) 22)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 97)
	(= (time-to-drive s3 s12) 97)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 42)
	(= (time-to-drive s4 s12) 42)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 49)
	(= (time-to-drive s9 s12) 49)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s9)
	(at driver2 s4)
	(at driver3 s1)
	(at driver5 s5)
	(at truck1 s12)
	(at truck3 s12)
	(at package1 s1)
	(at package2 s9)
	(at package4 s5)
	(at package5 s12)
	(at package6 s12)
	(at package7 s4)
	(at package8 s2)
	(at package9 s0)
	(at package10 s12)
	(at package11 s5)
	(at package12 s2)
	(at package13 s8)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s5)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 0 of 18
2. (drive-truck truck1 s5 s0 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 380
   goals met: 0 of 18
3. (load-truck package4 truck1 s0)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 0 of 18
4. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 380 to 512
   goals met: 0 of 18
5. (load-truck package9 truck1 s1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 0 of 18
6. (walk driver1 s8 p9-8)
   deleted: (at driver1 s8)
   added: (at driver1 p9-8)
   goals met: 0 of 18
7. (walk driver4 s6 p6-10)
   deleted: (at driver4 s6)
   added: (at driver4 p6-10)
   goals met: 0 of 18
8. (walk driver4 p6-10 s10)
   deleted: (at driver4 p6-10)
   added: (at driver4 s10)
   goals met: 0 of 18
9. (walk driver1 p9-8 s9)
   deleted: (at driver1 p9-8)
   added: (at driver1 s9)
   goals met: 1 of 18
10. (load-truck package2 truck3 s10)
   deleted: (at package2 s10)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 1 of 18
11. (load-truck package13 truck1 s1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 1 of 18
12. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 512 to 704
   goals met: 1 of 18
13. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 704 to 1216
   goals met: 1 of 18
14. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 1 of 18
15. (drive-truck truck1 s2 s3 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   changed: (fuel-used) from 1216 to 1576
   goals met: 1 of 18
16. (drive-truck truck1 s3 s7 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   changed: (fuel-used) from 1576 to 2196
   goals met: 1 of 18
17. (load-truck package10 truck1 s7)
   deleted: (at package10 s7)
   added: (in package10 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 1 of 18
18. (load-truck package11 truck1 s7)
   deleted: (at package11 s7)
   added: (in package11 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 1 of 18
19. (drive-truck truck1 s7 s8 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   changed: (fuel-used) from 2196 to 4087
   goals met: 1 of 18
20. (unload-truck package13 truck1 s8)
   deleted: (in package13 truck1)
   added: (at package13 s8)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 2 of 18
21. (load-truck package5 truck1 s8)
   deleted: (at package5 s8)
   added: (in package5 truck1)
   changed: (load truck1) from 5 to 6, (fuel-per-minute truck1) from 25 to 31
   goals met: 2 of 18
22. (drive-truck truck1 s8 s7 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   changed: (fuel-used) from 4087 to 5978
   goals met: 2 of 18
23. (drive-truck truck1 s7 s4 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   changed: (fuel-used) from 5978 to 8365
   goals met: 2 of 18
24. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 8365 to 9202
   goals met: 2 of 18
25. (board-truck driver4 truck3 s10)
   deleted: (at driver4 s10) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 2 of 18
26. (drive-truck truck3 s10 s9 driver4)
   deleted: (at truck3 s10)
   added: (at truck3 s9)
   changed: (fuel-used) from 9202 to 9345
   goals met: 2 of 18
27. (drive-truck truck3 s9 s11 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s11)
   changed: (fuel-used) from 9345 to 10423
   goals met: 2 of 18
28. (load-truck package8 truck3 s11)
   deleted: (at package8 s11)
   added: (in package8 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 2 of 18
29. (drive-truck truck3 s11 s9 driver4)
   deleted: (at truck3 s11)
   added: (at truck3 s9)
   changed: (fuel-used) from 10423 to 11697
   goals met: 2 of 18
30. (unload-truck package2 truck3 s9)
   deleted: (in package2 truck3)
   added: (at package2 s9)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 18
31. (drive-truck truck3 s9 s12 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s12)
   changed: (fuel-used) from 11697 to 12236
   goals met: 4 of 18
32. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 12236 to 13228
   goals met: 4 of 18
33. (unload-truck package9 truck1 s0)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   changed: (load truck1) from 6 to 5, (fuel-per-minute truck1) from 31 to 25
   goals met: 5 of 18
34. (drive-truck truck3 s12 s4 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s4)
   changed: (fuel-used) from 13228 to 13690
   goals met: 4 of 18
35. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 13690 to 13990
   goals met: 4 of 18
36. (drive-truck truck3 s4 s11 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s11)
   changed: (fuel-used) from 13990 to 14100
   goals met: 4 of 18
37. (load-truck package6 truck3 s11)
   deleted: (at package6 s11)
   added: (in package6 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 4 of 18
38. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 14100 to 14400
   goals met: 4 of 18
39. (drive-truck truck3 s11 s9 driver4)
   deleted: (at truck3 s11)
   added: (at truck3 s9)
   changed: (fuel-used) from 14400 to 15674
   goals met: 4 of 18
40. (drive-truck truck3 s9 s12 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s12)
   changed: (fuel-used) from 15674 to 16311
   goals met: 5 of 18
41. (unload-truck package6 truck3 s12)
   deleted: (in package6 truck3)
   added: (at package6 s12)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 6 of 18
42. (drive-truck truck1 s0 s5 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (fuel-used) from 16311 to 17261
   goals met: 6 of 18
43. (unload-truck package11 truck1 s5)
   deleted: (in package11 truck1)
   added: (at package11 s5)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 7 of 18
44. (unload-truck package4 truck1 s5)
   deleted: (in package4 truck1)
   added: (at package4 s5)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 8 of 18
45. (drive-truck truck1 s5 s0 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (fuel-used) from 17261 to 17869
   goals met: 8 of 18
46. (drive-truck truck3 s12 s2 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s2)
   changed: (fuel-used) from 17869 to 18364
   goals met: 7 of 18
47. (unload-truck package8 truck3 s2)
   deleted: (in package8 truck3)
   added: (at package8 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 18
48. (drive-truck truck3 s2 s12 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s12)
   changed: (fuel-used) from 18364 to 18814
   goals met: 9 of 18
49. (disembark-truck driver4 truck3 s12)
   deleted: (driving driver4 truck3)
   added: (at driver4 s12) (empty truck3)
   goals met: 9 of 18
50. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 18814 to 19326
   goals met: 9 of 18
51. (drive-truck truck1 s2 s4 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 19326 to 19758
   goals met: 9 of 18
52. (unload-truck package7 truck1 s4)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 10 of 18
53. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 10 of 18
54. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 10 of 18
55. (walk driver2 s2 p2-4)
   deleted: (at driver2 s2)
   added: (at driver2 p2-4)
   goals met: 10 of 18
56. (walk driver2 p2-4 s4)
   deleted: (at driver2 p2-4)
   added: (at driver2 s4)
   goals met: 11 of 18
57. (walk driver5 s0 p6-0)
   deleted: (at driver5 s0)
   added: (at driver5 p6-0)
   goals met: 11 of 18
58. (walk driver5 p6-0 s6)
   deleted: (at driver5 p6-0)
   added: (at driver5 s6)
   goals met: 11 of 18
59. (walk driver5 s6 p6-5)
   deleted: (at driver5 s6)
   added: (at driver5 p6-5)
   goals met: 11 of 18
60. (walk driver5 p6-5 s5)
   deleted: (at driver5 p6-5)
   added: (at driver5 s5)
   goals met: 12 of 18
61. (drive-truck truck1 s4 s12 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s12)
   changed: (fuel-used) from 19758 to 20304
   goals met: 13 of 18
62. (unload-truck package10 truck1 s12)
   deleted: (in package10 truck1)
   added: (at package10 s12)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 14 of 18
63. (drive-truck truck1 s12 s2 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s2)
   changed: (fuel-used) from 20304 to 20799
   goals met: 13 of 18
64. (drive-truck truck1 s2 s6 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (fuel-used) from 20799 to 21426
   goals met: 13 of 18
65. (load-truck package12 truck1 s6)
   deleted: (at package12 s6)
   added: (in package12 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 13 of 18
66. (load-truck package1 truck1 s6)
   deleted: (at package1 s6)
   added: (in package1 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 13 of 18
67. (drive-truck truck1 s6 s2 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (fuel-used) from 21426 to 22338
   goals met: 13 of 18
68. (unload-truck package12 truck1 s2)
   deleted: (in package12 truck1)
   added: (at package12 s2)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 14 of 18
69. (drive-truck truck1 s2 s12 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s12)
   changed: (fuel-used) from 22338 to 22923
   goals met: 15 of 18
70. (drive-truck truck1 s12 s9 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s9)
   changed: (fuel-used) from 22923 to 23560
   goals met: 14 of 18
71. (drive-truck truck1 s9 s1 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (fuel-used) from 23560 to 24184
   goals met: 14 of 18
72. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 15 of 18
73. (drive-truck truck1 s1 s3 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 24184 to 25240
   goals met: 15 of 18
74. (drive-truck truck1 s3 s12 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s12)
   changed: (fuel-used) from 25240 to 26307
   goals met: 16 of 18
75. (disembark-truck driver3 truck1 s12)
   deleted: (driving driver3 truck1)
   added: (at driver3 s12) (empty truck1)
   goals met: 16 of 18
76. (unload-truck package5 truck1 s12)
   deleted: (in package5 truck1)
   added: (at package5 s12)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 17 of 18
77. (walk driver3 s12 p1-12)
   deleted: (at driver3 s12)
   added: (at driver3 p1-12)
   goals met: 17 of 18
78. (walk driver3 p1-12 s1)
   deleted: (at driver3 p1-12)
   added: (at driver3 s1)
   goals met: 18 of 18
